package com.chris.prac.leetcode;
//LeetCode热题 Hot 100
//#	题名	题解	通过率	难度
//1
//两数之和  	10873	50.6%	简单
//2
//两数相加  	5233	39.7%	中等
//3
//无重复字符的最长子串  	5201	36.7%	中等
//4
//寻找两个正序数组的中位数  	2526	39.8%	困难
//5
//最长回文子串  	2692	33.5%	中等
//10
//正则表达式匹配  	909	31.0%	困难
//11
//盛最多水的容器  	2141	64.6%	中等
//15
//三数之和  	2075	31.4%	中等
//17
//电话号码的字母组合  	2098	56.1%	中等
//19
//删除链表的倒数第 N 个结点  	2615	41.3%	中等
//20
//有效的括号  	4113	43.8%	简单
//21
//合并两个有序链表  	2408	65.6%	简单
//22
//括号生成  	1814	77.0%	中等
//23
//合并K个升序链表  	1475	54.5%	困难
//31
//下一个排列  	1209	36.5%	中等
//32
//最长有效括号  	959	34.7%	困难
//33
//搜索旋转排序数组  	1580	40.9%	中等
//34
//在排序数组中查找元素的第一个和最后一个位置  	2135	42.3%	中等
//39
//组合总和  	1298	72.1%	中等
//42
//接雨水  	1763	54.8%	困难
//46
//全排列  	1801	77.7%	中等
//48
//旋转图像  	1373	72.5%	中等
//49
//字母异位词分组  	974	65.6%	中等
//53
//最大子序和  	2437	53.6%	简单
//55
//跳跃游戏  	1657	41.8%	中等
//56
//合并区间  	1631	44.7%	中等
//62
//不同路径  	1667	64.5%	中等
//64
//最小路径和  	1465	68.2%	中等
//70
//爬楼梯  	2454	51.6%	简单
//72
//编辑距离  	836	60.6%	困难
//75
//颜色分类  	1307	57.8%	中等
//76
//最小覆盖子串  	826	41.0%	困难
//78
//子集  	1367	79.6%	中等
//79
//单词搜索  	964	44.3%	中等
//84
//柱状图中最大的矩形  	858	42.9%	困难
//85
//最大矩形  	510	51.7%	困难
//94
//二叉树的中序遍历  	1520	75.0%	中等
//96
//不同的二叉搜索树  	906	69.3%	中等
//98
//验证二叉搜索树  	1349	33.8%	中等
//101
//对称二叉树  	1591	54.1%	简单
//102
//二叉树的层序遍历  	1754	64.2%	中等
//104
//二叉树的最大深度  	1830	75.9%	简单
//105
//从前序与中序遍历序列构造二叉树  	994	69.4%	中等
//114
//二叉树展开为链表  	920	72.0%	中等
//121
//买卖股票的最佳时机  	2447	56.3%	简单
//124
//二叉树中的最大路径和  	742	43.5%	困难
//128
//最长连续序列  	743	53.0%	困难
//136
//只出现一次的数字  	1563	71.1%	简单
//139
//单词拆分  	780	49.5%	中等
//141
//环形链表  	1911	50.9%	简单
//142
//环形链表 II  	1175	54.5%	中等
//146
//LRU 缓存机制  	954	52.0%	中等
//148
//排序链表  	860	67.4%	中等
//152
//乘积最大子数组  	824	41.2%	中等
//155
//最小栈  	1214	56.4%	简单
//160
//相交链表  	1198	57.9%	简单
//169
//多数元素  	1631	65.8%	简单
//198
//打家劫舍  	1759	47.9%	中等
//200
//岛屿数量  	1473	52.9%	中等
//206
//反转链表  	6246	71.5%	简单
//207
//课程表  	651	54.9%	中等
//208
//实现 Trie (前缀树)  	517	70.0%	中等
//215
//数组中的第K个最大元素  	1522	64.6%	中等
//221
//最大正方形  	696	44.8%	中等
//226
//翻转二叉树  	1337	78.1%	简单
//234
//回文链表  	1436	46.1%	简单
//236
//二叉树的最近公共祖先  	959	66.6%	中等
//238
//除自身以外数组的乘积  	649	71.5%	中等
//239
//滑动窗口最大值  	955	49.5%	困难
//240
//搜索二维矩阵 II  	452	44.6%	中等
//253
//会议室 II  	228	47.9%	中等
//279
//完全平方数  	669	59.6%	中等
//283
//移动零  	2335	63.7%	简单
//287
//寻找重复数  	885	66.5%	中等
//297
//二叉树的序列化与反序列化  	543	54.2%	困难
//300
//最长递增子序列  	1341	48.3%	中等
//301
//删除无效的括号  	163	50.2%	困难
//309
//最佳买卖股票时机含冷冻期  	617	57.8%	中等
//312
//戳气球  	271	67.7%	困难
//322
//零钱兑换  	1256	42.8%	中等
//337
//打家劫舍 III  	677	61.6%	中等
//338
//比特位计数  	1068	78.9%	中等
//347
//前 K 个高频元素  	1051	61.9%	中等
//394
//字符串解码  	968	54.2%	中等
//399
//除法求值  	435	59.4%	中等
//406
//根据身高重建队列  	580	72.6%	中等
//416
//分割等和子集  	635	49.6%	中等
//437
//路径总和 III  	591	56.6%	中等
//438
//找到字符串中所有字母异位词  	497	49.7%	中等
//448
//找到所有数组中消失的数字  	805	63.7%	简单
//461
//汉明距离  	751	79.0%	简单
//494
//目标和  	467	44.9%	中等
//538
//把二叉搜索树转换为累加树  	586	66.3%	中等
//543
//二叉树的直径  	952	52.5%	简单
//560
//和为K的子数组  	592	44.7%	中等
//581
//最短无序连续子数组  	394	36.1%	中等
//617
//合并二叉树  	856	78.8%	简单
//621
//任务调度器  	387	55.8%	中等
//647
//回文子串  	678	65.1%	中等
//739
//每日温度  	1098	66.4%	中等